Tekla.Structures.Dialog.UIControls.ImageComboBox
The ImageComboBox class represents a combo box control that can contain images.

Tekla.Structures.Dialog.UIControls.ImageComboBox.#ctor
Initializes a new instance of the ImageComboBox class.

Tekla.Structures.Dialog.UIControls.ImageComboBox.OptionList
Gets or sets the elements of the option list, the images that are in the image combo box.

Tekla.Structures.Dialog.UIControls.ImageComboBox.SelectedIndex
Gets or sets the selected index of the image in the image combo box.

Tekla.Structures.Dialog.UIControls.ImageComboBox.SelectedItem
Gets or sets the selected image in the image combo box.

Tekla.Structures.Dialog.UIControls.ImageComboBox.Size
Gets or sets the size of the image combo box.

Tekla.Structures.Dialog.UIControls.ImageComboBox.DefaultValue
Gets or sets the default value in the image combo box.

Tekla.Structures.Dialog.UIControls.ImageComboBox.ImageCBSelectedIndexChanged
The ImageCBSelectedIndexChanged event is triggered just after the selected index has been changed in the image combo box.

Tekla.Structures.Dialog.UIControls.ImageComboBox.components
Required designer variable.

Tekla.Structures.Dialog.UIControls.ImageComboBox.Dispose(System.Boolean)
Cleans up any resources being used.
disposing: True if managed resources should be disposed; otherwise, false.

Tekla.Structures.Dialog.UIControls.ImageComboBox.InitializeComponent
Required method for Designer support - do not modify
the contents of this method with the code editor.